#pragma once
#include <Arduino.h>

// Shuttle Status Strings
static const char* const SHUTTLE_STATUS_STRINGS[] = {
    "Запрос статуса",    // 0
    "Ручной режим",      // 1
    "Загрузка",          // 2
    "Выгрузка",          // 3
    "Уплотнение",        // 4
    "Эвакуация",         // 5
    "DEMO",              // 6
    "Подсчет паллет",    // 7
    "Испытания",         // 8
    "Обнаружены ошибки", // 9
    "Ожидание...",       // 10
    "Прод. загрузка",    // 11
    "Прод. выгрузка",    // 12
    "Прод. выгрузка",    // 13
    "  Вперед...",       // 14
    "  Назад...",        // 15
    "  Вверх...",        // 16
    "  Вниз...",         // 17
    "  Инициация..."     // 18
};

// Error Strings
static const char* const ERROR_STRINGS[] = {
    "Нет ошибок",       // 0
    "Сенсор канала F",  // 1
    "Сенсор канала R",  // 2
    "Сенсор канала DF", // 3
    "Сенсор канала DR", // 4
    "Сенсор паллет F",  // 5
    "Сенсор паллет R",  // 6
    "Сенсор паллет DF", // 7
    "Сенсор паллет DR", // 8
    "Подъемник",        // 9
    "Привод движ.",     // 10
    "Низкий заряд",     // 11
    "Столкновение",     // 12
    "Перегрев",         // 13
    "Ошибка 14",        // 14
    "Ошибка 15"         // 15
};
